'''
1、编写正则，匹配整数或者小数（包括正数和负数）

2、编写正则，匹配年月日日期 格式2018-12-31

3、编写正则，匹配qq号 5-12

4、编写正则，11位的电话号码

5、编写正则，长度为8-10位的用户密码 ： 包含数字字母下划线

6、编写正则，从18位省份证中提取用户生日日期

7、编写正则，从文本"a@com  b@qq.com 333@qq.com  333@168.com   19022@sina.com.cn"中匹配qq邮箱地址

8、从以下多行文本中提取href=""中的双引号的值，并提取标签内容 <a>内容<a>
"""
<a href="http://www.badu.com/s?wd=hahaha">hahaha</a>
<a href="http://www.tmall.com/">tmall</a>
<a href="http://www.tmall.com/">tmall</a>
"""
'''
import re
# 1、编写正则，匹配整数或者小数（包括正数和负数）

# txt = "10.3 10 20 -20 +20 --20 ++20 -30.5444"
# ret = re.findall(r"-?\+?\d+", txt)       #['10', '3', '10', '20', '-20', '+20', '-20', '+20', '-30', '5444']
# ret = re.findall(r"[\+\-]?(?:(?:\d+\.\d+)|(?:\d+))", txt)    #['10.3', '10', '20', '-20', '+20', '-20', '+20', '-30.5444']
# ret = re.findall(r"[\+\-]?(?:(?:\d+\.\d+)|(?:\d+))", txt)
# print(ret)

# 2、编写正则，匹配年月日日期 格式2018-12-31
# txt = "2018-12-31  2018-12-01 2018-12  2018-31 0000-12-31 2018-1-31 2018-01-31  20-01-31  20-01-1  2020-1-1  2020-01-01"
# ret = re.findall(r"[12]\d{3}-\d+-\d+", txt)   #['2018-12-31', '2018-12-01', '2018-1-31', '2018-01-31', '2020-1-1', '2020-01-01']
# print(ret)

# 3、编写正则，匹配qq号 5-123、编写正则，匹配qq号 5-12
# txt = "20181231  40001 2202020133  13311233220222 20202012024222 222050sss2222  33020202222  2001  202011  2020.0101222"
# ret = re.findall(r"[1-9]\d{4,11}", txt)
# print(ret)
# ['20181231', '40001', '2202020133', '133112332202', '202020120242', '222050', '33020202222', '202011', '101222']

# 4、编写正则，11位的电话号码
# txt = "1331234546 1501233453 15812345678  158-1234-5678  158 1234 5678   20022221111  10012345678  19012345678"
# ret = re.findall(r"1[3-9]\d{9}", txt)
# print(ret)
# ['15812345678', '19012345678']

# 如果 158-1234-5678 和 158 1234 5678也算呢？
# ret = re.findall(r"1[3-9]\d[\- ]?\d{4}[\- ]?\d{4}", txt)
# print(ret)
# ['15812345678', '158-1234-5678', '158 1234 5678', '19012345678']


# 5、编写正则，长度为8-10位的用户密码 ： 包含数字字母下划线
# password = input("请输入长度为8-10位的用户密码（包含数字字母下划线）：")
# ret = re.findall(r"^\w{8,10}$", password)
# print(ret)

# 6、编写正则，从18位省份证中提取用户生日日期
# idCard = "51142119991021155x"
# # ret = re.findall(r"^[1-6]\d{5}(\d{8})\d{3}[\dxX]$", idCard)
# ret = re.findall(r"^(?:1[1-5]|2[1-3]|3[1-7]|4[1-6]|5[0-4]|6[1-5])\d{4}(\d{8})\d{3}[\dxX]$", idCard)
# print(ret)

# 7、编写正则，从文本"a@com  b@qq.com 333@qq.com  333@168.com   19022@sina.com.cn"中匹配qq邮箱地址
# txt = "a@com  b@qq.com 333@qq.com  333@168.com   19022@sina.com.cn"
# # ret = re.findall(r"\w+@qq\.com", txt)
# ret = re.findall(r"\w+@\w+\.\w+(?:.cn)?", txt)
# print(ret)

# 8、从以下多行文本中提取href=""中的双引号的值，并提取标签内容 <a>内容<a>
txt = """
<a href="http://www.badu.com/s?wd=hahaha">hahaha</a>
<a href="http://www.tmall.com/">tmall</a>
<a href="http://www.tmall.com/">tmall</a>
"""

# ret = re.findall(r'<a href="(.*?)">(.*?)</a>', txt, re.S)
ret = re.findall(r'<a href="(?P<href>.*?)">(?P<content>.*?)</a>', txt, re.M+re.S)
print(ret)